'use strict'


// TASK#7
//
// Пользователь вводит два числа, если первое число равно или меньше единицы,
// а второе больше или равно трем, тогда программа выводит сумму этих чисел,
// в других случаях выводится их разность (первое минус второе).
// let a=parseInt(prompt('enter at number # 1')),
//     b=parseInt(prompt('enter at number # 2'));
//
// if (a <= 1 || a<1) {
//     alert(eval());
// } else {
//     alert('It`s not right');
// }

/*
Задача 1.
Пользователь вводит два числа первое  от 1 до 10, второе от 15 до 30,  необходимо вывести в документ при помощи цикла for,  интервал между введенными числами через перенос строки с итерацией +1.



Задача 3.
Реализовать скрипт, при помощи цикла while вывести  числа  в документ в промежутке 27  до 768, которые будут кратные 8.
Задача 4.
Реализовать задачу 2 и 3 с использованием цикла for.

Задача 5.
Реализовать два цикла for один будет вложенный во второй, условия обоих циклов: начало счетчика 1, окончание 10, шаг 2, необходимо каждую итерацию обоих циклов вывести в документ.

    Задача 6.
Вывести в документ используя цикл while  одинаковые изображения в кол-ве 5 шт.,  выводить через тег img.

    Задача 7.
Вывести в документ используя цикл  for  все цифры от 1 до 70 ,  которые не будут кратные 3.
Задача 8.
Пользователь вводит число пять раз, программа рассчитывает и выводит среднее арифметическое введенных чисел.*/


// Задача 2.
// Реализовать скрипт, при помощи цикла while вывести  числа  в документ в промежутке 15  до 52.