'use strict'
/*

-------------------Задача 1-------------------------------
Есть два массива:[10, 15,’Ivanov'] и [25, 30, ‘20’,’Petrov’], ' +
'необходимо объединить их вместе, вывести результат в виде строки в документ.*/

/*let a = [10, 15, 'Ivanov'],
    b = [25, 30, '20', 'Petrov'];
let x = a.concat(b);
console.log(x.toString());*/

/*
Задача 2
Из объединенного массива  по Задаче 1 создать 2
массива первый будет содержать только цифры второй строки, результат вывести в консоль*/


/*
let a = [10, 15, 'Ivanov'],
    b = [25, 30, '20', 'Petrov'];
let x = a.concat(b);
let j = [];
let v =[];
for (let i = 0; i < x.length; i++) {
    if (typeof x[i] == 'number') {
        j.push(x[i]);
    } else {
        v.push(x[i]);
    }

    // console.log(v.toString());
}
console.log(j.toString());
console.log(v.toString());
*/


/*
---------------------Задача 3--------------------------------
Пользователь вводит пять раз числа, из этих чисел
необходимо создать массив и вывести каждый элемент в документ через перенос строки в виде -  Число 1 => 25*/
/*
for (let i=0; i<5; i++) {
    let j= [];
        j.push(parseInt(prompt('enter a number')));
    console.log('number '+ i + ' = ' + j + ';');
}
*/

//------------------Задача 4---------------------------------
// Есть массив [25, 39, 48, 50, 14], необходимо создать новый
// массив в котором  после второго элемента будут такие новые элементы -  28, 39, 50, 99 , результат вывести в консоль.

/*let a = [25, 39, 48, 50, 14];
let b = a.slice(0,2);
let x = b.concat([28, 39, 50, 99]);
console.log(x);

---------------------------------------*/
/*
            Попытки

let a = [25, 39, 48, 50, 14];
let b = [28, 39, 50, 99];
let x = b.concat([28, 39, 50, 99]);
console.log(x);*/
// let b = a.slice(0,2);
// let x = b.concat([28, 39, 50, 99]);
//     // b.concat(a);
// b.concat(28, 39, 50, 99);
//
// // // let b = [];
// // let b.concat(a.splice(2, 3, 28, 39, 50, 99));
// console.log(b);
// // console.log(b);


//--------------------Задача 5--------------------
/*
Есть  массив [25, 39, 48, 50, 14, 255, 148, 300,15],
    необходимо создать новый массив в котором будут только такие элементы [ 255, 148, 300].*/

// let a = [25, 39, 48, 50, 14, 255, 148, 300, 15];
// let b = a.slice(5, 8);
// console.log(b);

//-------------------------------------------------


//--------------------Задача 6--------------------

/*
Пользователь вводит число 5 раз, необходимо вывести
при помощи функции  alert информацию про максимальное введенное число.*/

// let a=parseFloat(prompt('enter a number'));
// for (let i=1; i<=5; i++) {
//     let count = parseFloat(prompt('enter a number'));
// }
// alert ('entered 5 times');
