'use strict'

/*
Задача 1.
Пользователь вводит два числа первое от 1 до 10, второе от 15 до 30, необходимо вывести в документ при
помощи цикла for, интервал между введенными числами через перенос строки с итерацией +1.
*/
/*
let a = parseInt(prompt('enter at number from 1 to 10'));
let s = parseInt(prompt('enter at second number from 15 to 30'));
for (a, s; 1< a < 10, 15< s < 30; a++, s++) {
    document.write('iteration =' + a + s);
}

*/

// /*
// Задача 2.
// Реализовать скрипт, при помощи цикла while вывести числа в документ в промежутке 15 до 52.
let a =15;
while (a<52) {
    document.write(a+'<br>');
    a++;
}



// Задача 3.
// Реализовать скрипт, при помощи цикла while вывести числа в документ в промежутке 27 до 768, которые будут кратные 8.
// Задача 4.
// Реализовать задачу 2 и 3 с использованием цикла for.

Задача 5.
Реализовать два цикла for один будет вложенный во второй, условия обоих циклов: начало счетчика 1, окончание 10, шаг 2, необходимо каждую итерацию обоих циклов вывести в документ.

    Задача 6.
Вывести в документ используя цикл while одинаковые изображения в кол-ве 5 шт., выводить через тег img.

    Задача 7.
Вывести в документ используя цикл for все цифры от 1 до 70 , которые не будут кратные 3.
Задача 8.
Пользователь вводит число пять раз, программа рассчитывает и выводит среднее арифметическое введенных чисел.*/
